import 'package:flutter/material.dart';

class BioScreen extends StatelessWidget {
  BioScreen({super.key});

  String text = """
زندگی‌نامه

قاسم سلیمانی نام پدر حسن، متولد ۲۰ اسفند سال ۱۳۳۵ در شهرستان رابُر از توابع استان کرمان در ایل عشایر سلیمانی و فرمانده پیشین سپاه قدس است. او در دوران جنگ ایران و عراق فرمانده لشکر ۴۱ ثارالله و از فرماندهان عملیات‌های والفجر هشت، کربلای چهار و کربلای پنج بود.
قاسم سلیمانی در سال ۱۳۷۹ش از سوی آیت‌الله خامنه‌ای رهبر جمهوری اسلامی ایران، به فرماندهی سپاه قدس منصوب شد. پس از ظهور داعش در عراق و سوریه، سلیمانی به عنوان فرمانده سپاه قدس با حضور در این مناطق و سازماندهی نیروهای مردمی، به مبارزه با این گروه پرداخت. وی در سال ۱۳۸۹ش، موفق به أخذ درجه سرلشکری شد. سردار سلیمانی بامداد جمعه ۱۳ دی ماه ۱۳۹۸  به شهادت رسید. 

سوابق شغلی

قاسم سلیمانی در ۱۸ سالگی به استخدام اداره آب کرمان درآمد. او در حوادث انقلاب اسلامی ایران با روحانی مشهدی به نام رضا کامیاب آشنا شد و او را وارد جریانات انقلاب کرد. به نقل از سهراب سلیمانی، برادرش یکی از گردانندگان اصلی راهپیمایی‌ها و اعتصابات کرمان در زمان انقلاب بود.

دوران جنگ ایران و عراق

قاسم سلیمانی پس از انقلاب اسلامی ایران، در سال ۱۳۵۹ش عضو سپاه پاسدارن انقلاب اسلامی شد و هم‌زمان با شروع جنگ ایران و عراق، چند گردان را در کرمان آموزش داده و به جبهه‌ها فرستاد. وی در دوره‌ای فرماندهی سپاه آذربایجان غربی را بر عهده داشت. سلیمانی در سال ۱۳۶۰ش با حکم محسن رضایی فرمانده وقت سپاه پاسدارن، به عنوان فرمانده لشکر ۴۱ ثارالله منصوب شد.

وی در جنگ عراق علیه ایران، از فرماندهان عملیات‌های والفجر ۸، کربلای ۴ و کربلای ۵ بود. عملیات کربلای ۵ از مهم‌ترین عملیات‌های ایران در دوران جنگ دانسته شده که تضعیف موقعیت سیاسی و نظامی ارتش بعث عراق و تثبیت اوضاع به سود قوای نظامی ایران از نتایج آن ارزیابی شده است.

فعالیت‌های پس از دفاع مقدس

سلیمانی پس از پایان جنگ ایران و عراق در سال ۱۳۶۷ش، به کرمان بازگشت و درگیر جنگ با اشراری شد که از مرزهای شرقی ایران هدایت می‌شدند. سلیمانی تا قبل از انتصاب به فرماندهی سپاه قدس، با باندهای قاچاق مواد مخدر در مرزهای ایران و افغانستان می‌جنگید. او در بهمن سال ۱۳۸۹ش از سوی آیت الله خامنه‌ای، فرمانده کل قوای نظامی ایران درجه سرلشکری (بالاترین درجه نظامی در ایران) را دریافت کرد.

فرماندهی سپاه قدس

قاسم سلیمانی در سال ۱۳۷۹ش از سوی آیت‌الله خامنه‌ای به فرماندهی سپاه قدس منصوب شد. بر اساس گزارش نقل شده از مرکز ویژه اطلاعات اسرائیل، سپاه قدس در سال ۱۹۹۰م جهت افزایش فعالیت برون‌مرزی ایران شکل گرفت و سلیمانی پس از احمد وحیدی دومین فرمانده سپاه قدس ایران شد. طبق این گزارش، قاسم سلیمانی نقش کلیدی در تقویت نفوذ ایران در خاورمیانه به ویژه در ناآرامی‌های منطقه‌ای معروف به بیداری اسلامی (بهار عربی) ایفا کرده است.

حضور در عراق و سوریه و مبارزه با داعش

شهید حاج قاسم سلیمانی از فرماندهان مبارزه علیه داعش در عراق و سوریه است. داعش گروهی سلفی بود که پس از سقوط صدام در عراق و خلاء قدرت در این منطقه، پدید آمد. ایران برای حفظ امنیت و کنترل منطقه، مبارزه با این گروه را آغاز کرد. به نقل از خبرگزاری ایسنا، در سال ۲۰۱۱م نیروهای تحت فرمان سلیمانی از جمله لشکر فاطمیون و تیپ زینبیون جهت مبارزه با داعش و نیروهای شورشی راهی سوریه شدند. همچنین در سال ۲۰۱۴ شهر موصل به تصرف داعش درآمد و بغداد، پایتخت عراق نیز تا مرز سقوط پیش رفت؛ قاسم سلیمانی با سازماندهی بخشی از نیروهای حشد الشعبی نقش مؤثری در اخراج داعش از عراق داشت. حیدر العبادی نخست‌وزیر وقت عراق، از قاسم سلیمانی به عنوان یکی از اصلی‌ترین متحدان عراق در مبارزه با داعش نام برد. سلیمانی در نامه‌ای خطاب به آیت الله خامنه‌ای که ۳۰ آبان ۱۳۹۶ش در رسانه‌های ایران منتشر شد، پایان داعش را اعلام کرد و از برافراشته شدن پرچم سوریه در البوکمال از شهرهای سوریه در نزدیکی مرز عراق خبر داد. روزنامه اسرائیلی هاآرتص، سلیمانی را متهم به حضور در عملیات موشکی علیه اسرائیل و اقدام علیه یهودیان دنیا کرده است. فعالیت‌های سپاه قدس ایران در کنار دیگر مبارزان ضد گروه های تروریستی در نهایت سبب شد تا داعش در کشورهای عراق و سوریه نابود شود.

بخشی از پاسخ آیت‌الله خامنه‌ای رهبر معظم انقلاب به نامه حاج قاسم سلیمانی درباره پایان سیطره داعش:
شما با متلاشی ساختن تودۀ سرطانی و مهلک داعش نه‌فقط به کشورهای منطقه و به جهان اسلام بلکه به همۀ ملت‌ها و به بشریت خدمتی بزرگ کردید.

دریافت نشان ذوالفقار

در ۱۹ اسفند ۱۳۹۷ش آیت‌الله خامنه‌ای، نشان ذوالفقار - عالی‌ترین نشان نظامی ایران - را به سلیمانی اهدا کرد. طبق آئین‌نامه اهدای نشان‌های نظامی جمهوری اسلامی ایران، این نشان به فرماندهان عالی‌رتبه و رؤسای ستادهای عالی‌رتبه در نیروهای مسلح اهدا می‌شود که تدابیر آن‌ها در طرح‌ریزی و هدایت عملیات‌های رزمی موجب حصول نتایج مطلوب شده باشد. 

شهادت

بامداد جمعه ۱۳ دی ماه ۱۳۹۸ در حمله موشکی هلی کوپترهای آمریکایی به دو خودرو در اطراف فرودگاه بغداد، سردار قاسم سلیمانی فرمانده سپاه قدس و ابومهدی المهندس معاون حشدالشعبی و تنی چند از اعضای حشدالشعبی در این حمله هدف قرار گرفتند و به شهادت رسیدند. 

ای سرباز ولایت! ای که لبخندت جان ما را می‌سوزاند، درود بر تو که حتی خبر شهادت تو، اشک و امید و آرمان ما ایرانی‌ها را به هم نزدیک کرد. ما اجازه نمی‌دهیم صدای تو برایمان غریبه شود!
""";

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        backgroundColor: const Color(0xff064635),
        shadowColor: const Color(0xff519259),
        elevation: 15,
        title: const Text(
          'زندگینامه',
          style: TextStyle(
              fontSize: 28, color: Color(0xfff0bb62), fontFamily: 'btir'),
        ),
        centerTitle: true,
      ),
      backgroundColor: const Color(0xfff4eea0),
      body: Container(
        margin: const EdgeInsets.all(10),
        decoration: const BoxDecoration(
            color: Color(0xfff0bb62),
            borderRadius: BorderRadius.all(Radius.circular(10))),
        child: SingleChildScrollView(
          padding: EdgeInsets.all(15),
          scrollDirection: Axis.vertical,
          child: Text(
            text,
            textAlign: TextAlign.right,
            style: TextStyle(fontFamily: 'btir', height: 2.2),
          ),
        ),
      ),
    );
  }
}
